In [1]:
import pandas as pd

C:\Users\wq\AppData\Local\Temp\ipykernel_4580\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
pp = {'city' : ['Tripoli','Sydney','Tripoli','Rome','Rome', 'Tripoli', 'Rome', 'Sydney', 'Sydney'],
'rank': ['1st','2nd','1st','2nd','1st', '2nd', '1st', '2nd','1st'],
'score1' : [44,48,44,41,38,44,34,54,61],
'score2': [67,63,67,70,64,77,45,66,72],
}

df = pd.DataFrame(pp, columns=['city', 'rank',  'score1', 'score2'])
df

      city rank  score1  score2
0  Tripoli  1st      44      67
1   Sydney  2nd      48      63
2  Tripoli  1st      44      67
3     Rome  2nd      41      70
4     Rome  1st      38      64
5  Tripoli  2nd      44      77
6     Rome  1st      34      45
7   Sydney  2nd      54      66
8   Sydney  1st      61      72

In [17]:
type(df['score1'].groupby(df['city']))

pandas.core.groupby.generic.SeriesGroupBy

In [18]:
# get score1 of rows that city=Rome
df['score1'].groupby(df['city']).get_group('Rome')

3    41
4    38
6    34
Name: score1, dtype: int64

In [5]:
df['score1'].groupby(df['city']).describe()

         count       mean       std   min   25%   50%   75%   max
city
Rome       3.0  37.666667  3.511885  34.0  36.0  38.0  39.5  41.0
Sydney     3.0  54.333333  6.506407  48.0  51.0  54.0  57.5  61.0
Tripoli    3.0  44.000000  0.000000  44.0  44.0  44.0  44.0  44.0

In [6]:
df['score1'].groupby(df['city']).mean()

city
Rome       37.666667
Sydney     54.333333
Tripoli    44.000000
Name: score1, dtype: float64

In [7]:
df['score1'].groupby(df['city']).median()

city
Rome       38.0
Sydney     54.0
Tripoli    44.0
Name: score1, dtype: float64

In [10]:
df['score1'].groupby([df['city'], df['rank']]).describe()

              count  mean       std   min   25%   50%   75%   max
city    rank
Rome    1st     2.0  36.0  2.828427  34.0  35.0  36.0  37.0  38.0
        2nd     1.0  41.0       NaN  41.0  41.0  41.0  41.0  41.0
Sydney  1st     1.0  61.0       NaN  61.0  61.0  61.0  61.0  61.0
        2nd     2.0  51.0  4.242641  48.0  49.5  51.0  52.5  54.0
Tripoli 1st     2.0  44.0  0.000000  44.0  44.0  44.0  44.0  44.0
        2nd     1.0  44.0       NaN  44.0  44.0  44.0  44.0  44.0

In [12]:
import numpy as np
df.groupby('city').apply(lambda x: np.log2(x['score1']))

C:\Users\wq\AppData\Local\Temp\ipykernel_4580\3054414557.py:2: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('city').apply(lambda x: np.log2(x['score1']))

city
Rome     3    5.357552
         4    5.247928
         6    5.087463
Sydney   1    5.584963
         7    5.754888
         8    5.930737
Tripoli  0    5.459432
         2    5.459432
         5    5.459432
Name: score1, dtype: float64

In [13]:
# x is each group . x is series
df.groupby('city').apply(lambda x: np.mean(np.log2(x['score1'])))

C:\Users\wq\AppData\Local\Temp\ipykernel_4580\274618564.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby('city').apply(lambda x: np.mean(np.log2(x['score1'])))

city
Rome       5.230981
Sydney     5.756862
Tripoli    5.459432
dtype: float64